Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.XYZPointOnSecondCurve
Point on the second curve in 3d coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The property has not been set by the method providing the result.
Since:
2018.1

Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.XYZPointOnFirstCurve
Point on the first curve in 3d coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The property has not been set by the method providing the result.
Since:
2018.1

Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.#ctor(Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves)
Creates a copy of the ClosestPointsPairBetweenTwoCurves.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.1